# LinkConversionData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LinkConversionData Members
LinkConversionData Class Methods Properties See Also
---
The LinkConversionData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the LinkConversionData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetOptions | Extra information used during the creation of the Revit document. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Path | The path to the source data used to generate the model. |
| ServerId | The service responsible for converting the data into a Revit file. |

# See Also
LinkConversionData Class
Autodesk.Revit.DB Namespace